src/Documents/InventoryTransfer/InventoryTransfer.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InventoryTransfer</name>
  <registerRecords>AccumulationRegister.Inventory</registerRecords>
  <attributes>
    <name>WarehouseSender</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseReceiper</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>SendingStaff</name>
    <type>
      <types>CatalogRef.Staffs</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceivingStaff</name>
    <type>
      <types>CatalogRef.Staffs</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Products</name>
    <attributes>
      <name>Product</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Note</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Inventory/Inventory.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Inventory</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Product</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/InventoryTransfer/Forms/DocumentDetail/Module.bsl
&AtClient
Procedure ProductsProductOnChange(Item)
	// Insert handler content.    
	TabularSectionRow = Items.Products.CurrentData ;
	TabularSectionRow.Unit = FillUnit(TabularSectionRow.Product);
	
	RemainingQuantity = RemainingQuantityInWarehouse(Object.Date, Object.WarehouseSender,TabularSectionRow.Product);	
	If RemainingQuantity = "" Then
		 ThisObject.RemainingQuantity = 0;
	Else
		ThisObject.RemainingQuantity = RemainingQuantity;
	EndIf;
	ThisObject.Product =  TabularSectionRow.Product;
EndProcedure                                   

&AtServer
Function FillUnit (CurMatHang)
	Return CurMatHang.Unit ;
EndFunction

&AtServer

Function RemainingQuantityInWarehouse(Date, Warehouse,Product)
	  	//{{QUERY_BUILDER_WITH_RESULT_PROCESSING
	// This fragment was built by the wizard.
	// Warning! All manually made changes will be lost next time you use the wizard.
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	InventoryBalance.Product AS Product,
		|	ISNULL(InventoryBalance.QuantityBalance, 0) AS QuantityBalance
		|FROM
		|	AccumulationRegister.Inventory.Balance(&Date, ) AS InventoryBalance
		|WHERE
		|	InventoryBalance.Product = &Product
		|	AND InventoryBalance.Warehouse = &Warehouse";  
	
	Query.SetParameter("Product", Product);
	Query.SetParameter("Warehouse", Warehouse);  
	Query.SetParameter("Date", Date);
	
	QueryResult = Query.Execute();
	
	SelectionDetailRecords = QueryResult.Select();
	
	While SelectionDetailRecords.Next() Do
		Return SelectionDetailRecords.QuantityBalance
	EndDo;
	
	//}}QUERY_BUILDER_WITH_RESULT_PROCESSING

EndFunction

&AtClient
Procedure WarehouseSenderOnChange(Item)        
	
	TabularSectionRow = Items.Products.CurrentData ;
   	If ValueIsFilled(Object.Products) Then
		RemainingQuantity = RemainingQuantityInWarehouse(Object.Date, Object.WarehouseSender,TabularSectionRow.Product);	
		If RemainingQuantity = "" Then
			 ThisObject.RemainingQuantity = 0;
		Else
			ThisObject.RemainingQuantity = RemainingQuantity;
		EndIf; 
   	EndIf;
EndProcedure
